NAzT/iTracker_firmware_keil_Tencent_IoT-Suite/nRF5_SDK_14.0.0_3bcc1f7/itracker-tc/ble_peripheral/itracker/main.c
#define  DEST_DOMAIN              "www.baidu.com"
#define  DEST_PORT                80
#define  DEST_URL									""
#define  POST_FORMAT 				\
				"{\r\n"							\
				"\"temp\" : %.2f,\r\n"				\
				"\"humi\" : %.2f,\r\n"				\
				"\"press\" : %.2f,\r\n"				\
				"\"light\" : %.2f,\r\n"				\
				"\"lati\" : %.2f,\r\n"\
				"\"longi\" : %.2f,\r\n"\
				"\"X\" : %d,\r\n"				\
				"\"Y\" : %d,\r\n"		\
				"\"Z\" : %d,\r\n"			\
				"\"m_x\" : %.2f,\r\n"				\
				"\"m_y\" : %.2f,\r\n"\
				"\"m_z\" : %.2f\r\n"\
				"}\r\n"


int GsmInit()
{
    //int  retavl;
    int time_count;
	
#if defined (M35)			
    DPRINTF(LOG_INFO,"check auto baud\r\n");
    /*module init ,check is auto baud,if auto,config to 115200 baud.*/ 
    Gsm_CheckAutoBaud();
    
    DPRINTF(LOG_INFO,"set echo\r\n");
    /*isable cmd echo*/
    Gsm_SetEchoCmd(0); //AT_COMMAND ATE
    
    DPRINTF(LOG_INFO,"check sim card\r\n");
    /*check SIM Card status,if not ready,retry 60s,return*/
    time_count=0;
    while((Gsm_CheckSimCmd()<0))
    {
        delay_ms(GSM_CHECKSIM_RETRY_TIME);
               
        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
        {
            DPRINTF(LOG_WARN,"check sim card timeout\r\n");
            return -1;
        }
    }
#endif 
		
    DPRINTF(LOG_INFO,"check network\r\n");
    /*check Network register status,if not ready,retry 60s,return*/
    time_count=0;
    while((Gsm_CheckNetworkCmd()<0))
    {
        delay_ms(GSM_CHECKSIM_RETRY_TIME);
        //delay_ms(300);     
        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
        {
            DPRINTF(LOG_WARN,"check network timeout\r\n");
            return -1;
        }
    }

    DPRINTF(LOG_INFO,"check GPRS\r\n");
    /*check GPRS  status,if not ready,retry 60s,return*/
    //Gsm_SetGPRSCmd();
    time_count=0;
    while((Gsm_CheckGPRSCmd()<0))
    {
        delay_ms(GSM_CHECKSIM_RETRY_TIME);
               
        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
        {
            DPRINTF(LOG_WARN,"check GPRS timeout\r\n");
            return -1;
        }
    }
#if defined (BC95)
		DPRINTF(LOG_INFO,"check con status\r\n");
    /*check GPRS  status,if not ready,retry 60s,return*/
    time_count=0;
    while((Gsm_CheckConStatusCmd()<0))
    {
        delay_ms(GSM_CHECKSIM_RETRY_TIME);
               
        if(++time_count>GSM_CHECKSIM_RETRY_NUM)
        {
            DPRINTF(LOG_WARN,"check GPRS timeout\r\n");
            return -1;
        }
    }
		DPRINTF(LOG_INFO,"BC95 Connected\r\n");
#endif
#if defined (M35)		
    /*Set Context*/
		DPRINTF(LOG_INFO,"set context 0\r\n");
    Gsm_SetContextCmd();
   
    Gsm_SetQNDI(1);
    /*Set dns mode 1, domain*/
	DPRINTF(LOG_INFO,"set dns mode\r\n");
    Gsm_SetDnsModeCmd();
    /*Set qi send echo 0*/
    //Gsm_SetSdEchoCmd();
		/*Set auto reply*/
		//DPRINTF(LOG_INFO,"set auto reply mode\r\n");
		Gsm_SetAtsEnCmd();

    DPRINTF(LOG_INFO,"check GSM Network ok!!\r\n");
#endif
    int rssi=0;
    rssi= Gsm_GetRssiCmd();
    
    DPRINTF(LOG_INFO, "rssi=%d\r\n",rssi);
    
		return 0;
}


				
int Gsm_HttpPost(uint8_t* data, uint16_t len)
{ 
    int        ret = -1;
    uint16_t   httpLen = 0;
    uint8_t*   http_buf = NULL; 
    char       testbuf[256];

    ret = Gsm_OpenSocketCmd(GSM_TCP_TYPE, DEST_DOMAIN, DEST_PORT); 
    if(ret != 0)
    {
			  Gsm_CloseSocketCmd(); 
        return -1; 
    }
    DPRINTF(LOG_INFO, "Gsm_OpenSocketCmd OK\n");
    Gsm_RecvData2(testbuf, sizeof(testbuf), 5000);

    http_buf = malloc(256);
    if(http_buf == NULL)
    {
       DPRINTF(LOG_INFO, "\r\n-----http_buf malloc 256 fail!!!-----\r\n");
       return -1;
    }
    
    httpLen =sprintf((char *)http_buf,
                     "POST /%s HTTP/1.1\r\n"
                     "Host: %s\r\n"
                     "Content-Length: %d\r\n"
                     "Content-Type: application/json\r\n\r\n",
                     DEST_URL, DEST_DOMAIN, len);
    
    DPRINTF(LOG_DEBUG, "Gsm_HttpPost head %d - %s\r\n", httpLen, http_buf);
    ret =Gsm_SendDataCmd((char *)http_buf,httpLen); 
    
    //delay_ms(1000);
    DPRINTF(LOG_DEBUG, "Gsm_HttpPost body len %d\r\n", len);
    ret =Gsm_SendDataCmd((char *)data,len); 
    //DPRINTF(LOG_DEBUG, "Gsm_SendDataCmd %s", data);
    if (ret < 0) {
      DPRINTF(LOG_ERROR, "Gsm_HttpPost send fail...\r\n");
      free(http_buf);
      Gsm_CloseSocketCmd(); 
      return ret;   
    }
    
    free(http_buf);
    return ret;
}

int Gsm_HttpRsp(void)
{
    int        read_len; 
    char*      http_RecvBuf =NULL;
    int        ret = -1;
        
    http_RecvBuf = malloc(1024);
    if(http_RecvBuf == NULL)
    {
       DPRINTF(LOG_INFO, "\r\n-----http_RecvBuf malloc 1024 fail!!!-----\r\n");
       return -1;
    }
     
	//read_len = Gsm_RecvData(http_RecvBuf, 5000);//5 s 
    memset(http_RecvBuf, 0 , 1024);
    read_len = Gsm_RecvData2(http_RecvBuf, 1024, 5000);//5 s 
    
    if(read_len > 0) 
    {
        //DPRINTF(LOG_DEBUG, "Gsm_HttpRsp response len=%d\r\n", read_len);
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp ret %d - %s", read_len, http_RecvBuf);
    }
    else
    {
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp Gsm_RecvData2 len=%d\r\n", read_len);
    }
    
    delay_ms(200);
    memset(http_RecvBuf, 0 , 1024);
    read_len = Gsm_RecvData2(http_RecvBuf, 1024, 5000);//5 s 
    DPRINTF(LOG_DEBUG, "Gsm_HttpRsp Gsm_RecvData2 len=%d\r\n", read_len);
    if(read_len > 0) 
    {
        //DPRINTF(LOG_DEBUG, "Gsm_HttpRsp response len=%d\r\n", read_len);
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp ret %d - %s", read_len, http_RecvBuf);
    }
    else
    {
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp Gsm_RecvData2 len=%d\r\n", read_len);
    }

    delay_ms(200);
    memset(http_RecvBuf, 0 , 1024);
    read_len = Gsm_RecvData2(http_RecvBuf, 1024, 5000);//5 s 
    if(read_len > 0) 
    {
        //DPRINTF(LOG_DEBUG, "Gsm_HttpRsp response len=%d\r\n", read_len);
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp ret %d - %s", read_len, http_RecvBuf);
    }
    else
    {
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp Gsm_RecvData2 len=%d\r\n", read_len);
    }

    delay_ms(200);
    memset(http_RecvBuf, 0 , 1024);
    read_len = Gsm_RecvData2(http_RecvBuf, 1024, 5000);//5 s 
    if(read_len > 0) 
    {
        //DPRINTF(LOG_DEBUG, "Gsm_HttpRsp response len=%d\r\n", read_len);
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp ret %d - %s", read_len, http_RecvBuf);
    }
    else
    {
        DPRINTF(LOG_DEBUG, "Gsm_HttpRsp Gsm_RecvData2 len=%d\r\n", read_len);
    }

