NAzT/iTracker_firmware_keil_Tencent_IoT-Suite/nRF5_SDK_14.0.0_3bcc1f7/itracker-tc/ble_peripheral/itracker/main.c
    free(http_RecvBuf);
    Gsm_CloseSocketCmd(); 
	
    return ret;
}
#endif

void start_collect_data()
{
		int ret;
#ifdef BEM280_TEST
		get_bme280_data(&tracker_data.temp_value, &tracker_data.humidity_value, &tracker_data.gas_value);
#endif
#ifdef LIS3DH_TEST
		ret = lis3dh_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "lis3dh_twi_init fail %d\r\n", ret);
		} else {
				get_lis3dh_data(&tracker_data.x, &tracker_data.y, &tracker_data.z);		
		}
#endif
#ifdef LIS2MDL_TEST
		ret = lis2mdl_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "lis2mdl_twi_init fail %d\r\n", ret);
		} else {
				get_lis2mdl_data(&tracker_data.magnetic_x, &tracker_data.magnetic_y, &tracker_data.magnetic_z);
		}
#endif
#ifdef OPT3001_TEST
		ret = opt3001_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "opt3001_twi_init fail %d\r\n", ret);
		} else {
				get_opt3001_data(&tracker_data.light_value);		
		}
#endif
		
}

/**@brief timers.
 */
APP_TIMER_DEF(sensor_collect_timer);

char * float2str(float val, int precision, char *buf)
{
    char *cur, *end;
    
    sprintf(buf, "%.6f", val);
    if (precision < 6) {
        cur = buf + strlen(buf) - 1;
        end = cur - 6 + precision; 
        while ((cur > end) && (*cur == '0')) {
            *cur = '\0';
            cur--;
        }
    }
    
    return buf;
}

char * double2str(double val, int precision, char *buf)
{
    char *cur, *end;
    
    sprintf(buf, "%.6f", val);
    if (precision < 6) {
        cur = buf + strlen(buf) - 1;
        end = cur - 6 + precision; 
        while ((cur > end) && (*cur == '0')) {
            *cur = '\0';
            cur--;
        }
    }
    
    return buf;
}

char lati_buf[128];
char longi_buf[128];
uint8_t collect_flag = 0;

void sensor_collect_timer_handle()
{
		int ret;
		static uint32_t swi_cnt=0;
	
//		if(collect_flag)
//		{
//			collect_flag = 0;
//		}
//		else
//		{
//			return;
//		}
	
		start_collect_data();
	
//		Gps_Uart_Init();
//		GpsGetLatestGpsPositionDouble(&tracker_data.latitude, &tracker_data.longitude);
//		Gsm_Uart_Init();

		sprintf(post_data, POST_FORMAT, tracker_data.temp_value,
																		tracker_data.humidity_value,
																		tracker_data.gas_value,
																		/*tracker_data.barometer_value,*/
																		tracker_data.light_value,
																		tracker_data.latitude,
																		tracker_data.longitude,
																		tracker_data.x,
																		tracker_data.y,
																		tracker_data.z,
																		tracker_data.magnetic_x,
																		tracker_data.magnetic_y,
																		tracker_data.magnetic_z
																		);
		DPRINTF(LOG_INFO, "%s", post_data);
		swi_cnt++;
//		if(swi_cnt==1)
//		{
//				DPRINTF(LOG_INFO, "uart switch to gps 666\n");
//				Gps_Uart_Init();
//				GpsGetLatestGpsPositionDouble(&tracker_data.latitude, &tracker_data.longitude);
//				float2str((float)tracker_data.latitude, 2, lati_buf);
//				float2str((float)tracker_data.longitude, 2, longi_buf);
//				DPRINTF(LOG_INFO, "gps latitude=%s lontitude=%s\n", lati_buf, longi_buf);
//		}
//		else if(swi_cnt>=1)
//		{
//				swi_cnt = 0;
//				if(gsm_started)
//				{
//						DPRINTF(LOG_INFO, "uart switch to gsm");
//						Gsm_Uart_Init();

						
                        //test_mqtt();
												//tc_io_main();
                       /*do {
                            IOT_TRACE( "test_mqtt\r\n" );
                            delay_ms(1000);
                        }	while(1);	*/
//#if defined (M35)
//						ret = Gsm_HttpPost(post_data, strlen(post_data));
//						if (ret >0 ) 
//						{
//							 ret = Gsm_HttpRsp();
//						}		
//#endif
//						int rssi=0;
//						rssi= Gsm_GetRssiCmd();
//						
//						DPRINTF(LOG_INFO, "rssi=%d\r\n",rssi);
//					}
					//else
					{
						DPRINTF(LOG_INFO, "gsm not started\r\n");
					}		
//		}
}

void _sensor_collect_timer_handle()
{
		collect_flag = 1;
        DPRINTF(LOG_INFO, "rtc1_get_sys_tick ret %u\r\n",  rtc1_get_sys_tick());
}

uint32_t sensor_collect_timer_init(void)
{
    app_timer_create(&sensor_collect_timer,APP_TIMER_MODE_REPEATED,_sensor_collect_timer_handle);
		//app_timer_start(sensor_collect_timer, 30000, NULL);
		app_timer_start(sensor_collect_timer, 10000, NULL);
}

void sensors_init()
{
		int ret;
#ifdef BEM280_TEST
		ret = bme280_spi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "bme280_spi_init fail %d\r\n", ret);
		} else {
				ret = _bme280_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "lis3dh_init fail1\r\n");
				}
		}
#endif
#ifdef LIS3DH_TEST
		ret = lis3dh_twi_init();
		if(ret != NRF_SUCCESS) {
				DPRINTF(LOG_ERROR, "lis3dh_twi_init fail %d\r\n", ret);
		} else {
				ret = lis3dh_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "lis3dh_init fail2\r\n");
				}
		}
#endif
#ifdef LIS2MDL_TEST
		ret = lis2mdl_twi_init();
		if(ret < 0) {
				DPRINTF(LOG_ERROR, "lis2mdl_twi_init fail %d\r\n", ret);
		} else {
				ret = lis2mdl_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "lis2mdl_init fail\r\n");
				}
		}
#endif
#ifdef OPT3001_TEST
		ret = opt3001_twi_init();
		if(ret < 0) {
				DPRINTF(LOG_ERROR, "opt3001_twi_init fail %d\r\n", ret);
		} else {
				ret = opt3001_init();
				if(ret < 0) {
						DPRINTF(LOG_ERROR, "opt3001_init fail\r\n");
				}
		}
#endif
}

void test_rtc();
/**@brief Application main function.
 */

int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;
		int ret;

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    log_init();
    //buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
		
		//test_rtc();
		DPRINTF(LOG_INFO, "iTracker Start V1.0.0\r\n");
		// init gsm
		Gsm_Uart_Init();		
		Gsm_Gpio_Init();
		Gsm_PowerUp();
		ret = GsmInit();
		if(ret == 0)
		{
				gsm_started = 1;
		}
		// init gps
		GpsInit();
		// init sensors
		sensors_init();
		
		sensor_collect_timer_init();
		
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
		
		//err_code = app_timer_start(m_sec_req_timer_id, SECURITY_REQUEST_DELAY, NULL);
		//APP_ERROR_CHECK(err_code);
    // Enter main loop.

    //delay_ms(2000);
    
//    for (;;)
//    {
//        
//        power_manage();
//			 
//				//GSM post & sensors collect every 10s
//				
//				//GPS collect every 10s
//			
//				//sonsors every 10s
//				if(collect_flag)
//				{
//						collect_flag = 0;
//                        
//						sensor_collect_timer_handle();
//				}
//				
//    }
		if(gsm_started)
		{
			Gsm_Uart_Init();
			tc_io_main();
		}
		else
		{
			DPRINTF(LOG_INFO, "gsm not started\r\n");
		}
}


static const nrf_drv_rtc_t _rtc = NRF_DRV_RTC_INSTANCE(0); /**< Declaring an instance of nrf_drv_rtc for RTC0. */
#define COMPARE_COUNTERTIME  (3UL)      

volatile static int count1 = 0;
volatile static int count2 = 0;
static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{

    if (int_type == NRF_DRV_RTC_INT_COMPARE0)
    {
        //nrf_gpio_pin_toggle(COMPARE_EVENT_OUTPUT);
        count1 ++ ;
        if (count1%8==3)
        {
            DPRINTF(LOG_INFO, "count1=%d\r\n",count1);
        }

    }
    else if (int_type == NRF_DRV_RTC_INT_TICK)
    {
        //nrf_gpio_pin_toggle(TICK_EVENT_OUTPUT);
        count2 ++;
        if (count2%4==3)
        {
            DPRINTF(LOG_INFO, "count2=%d\r\n",count2);
        }        
    }
}

static void _lfclk_config(void)
{
    DPRINTF(LOG_DEBUG, "_lfclk_config\r\n");
    ret_code_t err_code = nrf_drv_clock_init();
    DPRINTF(LOG_DEBUG, "nrf_drv_clock_init ret %u\r\n", err_code);
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);
}

static void _rtc_config(void)
{
    uint32_t err_code;

    //Initialize RTC instance
    nrf_drv_rtc_config_t config = NRF_DRV_RTC_DEFAULT_CONFIG;
    config.prescaler = 4095;
    DPRINTF(LOG_DEBUG, "_rtc_config1\r\n");
    err_code = nrf_drv_rtc_init(&_rtc, &config, rtc_handler);
    DPRINTF(LOG_DEBUG, "nrf_drv_rtc_init ret %u\r\n", err_code);
    APP_ERROR_CHECK(err_code);

    //Enable tick event & interrupt
    nrf_drv_rtc_tick_enable(&_rtc,true);

    DPRINTF(LOG_DEBUG, "_rtc_config2\r\n");
    //Set compare channel to trigger interrupt after COMPARE_COUNTERTIME seconds
    err_code = nrf_drv_rtc_cc_set(&_rtc,0,COMPARE_COUNTERTIME * 8,true);
    DPRINTF(LOG_DEBUG, "nrf_drv_rtc_cc_set ret %u\r\n", err_code);
    APP_ERROR_CHECK(err_code);

    //Power on RTC instance
    nrf_drv_rtc_enable(&_rtc);
}

void test_rtc()
{
    
    _lfclk_config();

    _rtc_config();
}
/**
 * @}
 */
